# CanFlipPart Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..CanFlipPart Method
FabricationPart Class See Also
---
Validates if the fabrication part is one of the supported fabrication part types that can be flipped.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool CanFlipPart()
```

Visual Basic
---
```text
Public Function CanFlipPart As Boolean
```

Visual C++
---
```text
public:
bool CanFlipPart()
```

# ### Return Value
Returns true if valid otherwise false if the fabrication part cannot be flipped.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace